import React, { useEffect } from "react";
import "../Style/TermsAndConditions.css";

const TermsAndConditions = () => {
  useEffect(() => {
    window.scrollTo(0, 0); // Scroll to the top of the page on mount
  }, []);

  return (
    <div className="terms-container">
      <h1>תקנון ותנאי שימוש באתר</h1>
      <section>
        <h2>1. כללי</h2>
        <p>
          1.1. תנאי השימוש מסדירים את היחסים בין האתר לבין כל אדם הגולש ו/או
          משתמש באתר.
        </p>
        <p>1.2. יש לקרוא בעיון את תנאי השימוש לפני ביצוע כל פעולה באתר.</p>
        <p>
          1.3. האתר רשאי לשנות את התקנון ותנאי השימוש מעת לעת, לפי שיקול דעתו
          הבלעדי.
        </p>
        <p>
          1.4. האתר רשאי להפסיק או לשנות את פעילותו בכל עת וללא הודעה מוקדמת.
        </p>
      </section>
      <section>
        <h2>2. שימוש באתר</h2>
        <p>2.1. האתר מיועד לשימוש אישי בלבד ואינו לשימוש מסחרי.</p>
        <p>
          2.2. כל שאלה או הבהרה ניתן לפנות לשירות הלקוחות בדוא"ל:
          Repli.car911@gmail.com.
        </p>
        <p>2.3. השימוש באתר ובתכניו הינו על בסיס "כמות שהוא" ("AS IS").</p>
      </section>
      <section>
        <h2>3. מוצרים ומחיריהם</h2>
        <p>
          3.1. האתר מציג מוצרים שונים למכירה, והתכנים עשויים להשתנות מעת לעת.
        </p>
        <p>3.2. מחירי המוצרים באתר כוללים מע"מ אך אינם כוללים דמי משלוח.</p>
        <p>3.3. האתר רשאי לעדכן את המחירים והתנאים בכל עת.</p>
      </section>
      <section>
        <h2>4. ביצוע הזמנה ורכישה באתר</h2>
        <p>4.1. רכישת מוצרים מותנית בהסכמה לתנאי השימוש.</p>
        <p>4.2. המשתמש אחראי לשמירת סיסמאותיו ולפרטים שהזין באתר.</p>
        <p>4.3. הרכישה מתבצעת באמצעות כרטיסי אשראי מוכרים בלבד.</p>
      </section>
      <section>
        <h2>5. אחריות</h2>
        <p>
          5.1. האתר לא יישא באחריות לנזקים עקיפים, מיוחדים או תוצאתיים שנגרמו
          למשתמש.
        </p>
        <p>
          5.2. האחריות הבלעדית למוצרים המוצגים באתר הינה על היצרנים ו/או
          היבואנים.
        </p>
        <p>
          5.3. המידע באתר עשוי לכלול אי-דיוקים או טעויות, והאתר אינו אחראי על
          תכנים המופיעים בו.
        </p>
      </section>
    </div>
  );
};

export default TermsAndConditions;
